extends Node

var dialog = load("res://Dialog.gd")

var characters = ["character-1684872351.json", "character-1684872362.json"]
var questions = [
	dialog.Question.new(
		"Ποια από τα πιο κάτω δεν είναι λειτουργία της Κεντρικής Μονάδας Επεξεργασίας;",
		["a) Εκτελεί τις οδηγίες του προγράμματος", "b) Επιβεβαιώνει ότι οι οδηγίες του προγράμματος εκτελούνται με σωστή σειρά", "c) Αποστολή ηλεκτρονικού μηνύματος", "d) Διεξάγει υπολογισμούς"],
		["Χμμ, δεν είμαι τόσο σίγουρος", "Μπαα", "Σωστά!", "Δυστυχώς όχι"],
		[false, false, true, false]
	),
	dialog.Question.new(
		"Ποιο από τα πιο κάτω είναι ταυτόχρονα συσκευή εισόδου και εξόδου;",
		["a) Οθόνη αφής", "b) Πληκτρολόγιο ", "c) Εκτυπωτής", "d) Σαρωτής"],
		["Σωστά!", "Όχι", "Γκούχου γκούχου", "Νιετ"],
		[true, false, false, false]
	),
	dialog.Question.new(
		"Ποιο από τα ακόλουθα ισοδυναμεί με 13GB;",
		["a) 13000 bytes (περίπου)", "b) 13000 KB (περίπου)", "c) 13000 TB (περίπου)", "d) 13000 MB (περίπου)"],
		["Όχι", "Γκούχου γκούχου", "Νιετ", "Σωστά!"],
		[false, false, false, true]
	),
	dialog.Question.new(
		"Ποιο από τα πιο κάτω είναι λειτουργία της Κεντρικής Μονάδας Επεξεργασίας (KME);",
		["a) Εκτελεί όλες τις αριθμητικές και λογικές λειτουργίες στα δεδομένα", "b) Εκτελεί όλες τις γραφικές λειτουργίες στα δεδομένα", "c) Εκτελεί όλες τις κύριες λειτουργίες στα δεδομένα", "d) Εκτελεί όλες τις λειτουργίες συστήματος των δεδομένων"],
		["Σωστά!", "Όχι", "Γκούχου γκούχου",  "Νιετ"],
		[true, false, false, false]
	),
	dialog.Question.new(
		"Τί συμβολίζουν τα αρχικά RAM;",
		["a) Μνήμη Τυχαίας Επιτάχυνσης", "b) Μνήμη Τυχαίας Προσπέλασης", "c) Μνήμη Κανονικής Προσπέλασης", "d) Μνήμη Κανονικής Επιτάχυνσης"],
		["Όχι", "Σωστά!", "Γκούχου γκούχου", "Νιετ"],
		[false, true, false, false]
	),
	dialog.Question.new(
		"Ποια είναι η μικρότερη μονάδα μέτρησης του H/Y; ",
		["a) Megabyte", "b) Bit", "c) Kilobyte", "d) Byte"],
		["Γκούχου γκούχου", "Σωστά!", "Όχι", "Νιετ"],
		[false, true, false, false]
	),	
	dialog.Question.new(
		"Τί κάνει ένας διαμορφωτής/αποδιαμορφωτής (Modem);",
		["a) Προστατεύει ένα δίκτυο έναντι αυτών που σπάνε προγράμματα", "b) Συνδέει τον υπολογιστή σας με την τηλεφωνική γραμμή", "c) Αποκρύπτει τα δεδομένα του υπολογιστή", "d) Μετατρέπει ψηφιακά δεδομένα σε δεκαεξάδικο σύστημα"],
		["Γκούχου γκούχου", "Σωστά!", "Όχι", "Νιετ"],
		[false, true, false, false]
	),
	dialog.Question.new(
		"Όταν ανοίγει ο υπολογιστής και πριν φορτωθεί το λειτουργικό σύστημα, ποιος δίνει τις οδηγίες για την εκκίνηση και τον αρχικό έλεγχο του υπολογιστή;",
		["a) H μνήμη RAM", "b) O σκληρός δίσκος", "c) H μνήμη ROM", "d) O επεξεργαστής"],
		["Γκούχου γκούχου", "Όχι", "Σωστά!", "Νιετ"],
		[false, false, true, false]
	),
	dialog.Question.new(
		"Ποια από τις πιο κάτω εργασίες είναι λειτουργία του Λειτουργικού Συστήματος;",
		["a) Προσθήκη δεδομένων σε ένα υπολογιστικό φύλλο", "b) Εκπόνηση έκθεσης βάσης δεδομένων", "c) Διαχείριση αρχείων", "d) H παραγωγή μιας παρουσίασης"],
		["Γκούχου γκούχου", "Όχι", "Σωστά!", "Νιετ"],
		[false, false, true, false]
	),
	dialog.Question.new(
		"Ποια από τις πιο κάτω ενέργειες αποτελεί το τελευταίο μέρος της Επεξεργασίας Ανάπτυξης Συστημάτων;",
		["a) Έλεγχος", "b) Προγραμματισμός", "c) Σχεδιασμός", "d) Ανάλυση"],
		["Σωστά!", "Γκούχου γκούχου", "Όχι", "Νιετ"],
		[true, false, false, false]
	),
	dialog.Question.new(
		"Ποιο από τα παρακάτω είναι πλεονέκτημα ενός γραφικού περιβάλλοντος επικοινωνίας (GUI);",
		["a) H ασφαλέστερη πρόσβαση στο διαδίκτυο", "b) Η ασφαλέστερη εμφάνιση των γραφικών σε ανεξάρτητου μεγέθους οθόνη", "c) Η γρηγορότερη απεικόνιση των γραφικών", "d) Η φιλικότερη επικοινωνία μεταξύ του χρήστη και του λειτουργικού συστήματος"],
		["Γκούχου γκούχου", "Όχι", "Νιετ", "Σωστά!"],
		[false, false, false, true]
	),
	dialog.Question.new(
		"Τι συμβολίζουν τα αρχικά DSL;",
		["a) Direct Status Link", "b) Dynamic Synchronous Live", "c) Digital Subscriber Line", "d) Digital Synchronous Line"],
		["Γκούχου γκούχου", "Όχι", "Σωστά!", "Νιετ"],
		[false, false, true, false]
	),
	dialog.Question.new(
		"Τι κάνει ακριβώς το modem;",
		["a) Διαμορφώνει και αναδιαμορφώνει το ψηφιακό σήμα σε αναλογικό", "b) Μετατρέπει το δυαδικό σύστημα σε δεκαδικό", "c) Διαμορφώνει το δυαδικό σύστημα σε ψηφιακό", "d) Μετατρέπει το ψηφιακό σήμα σε αναλογικό"],
		["Σωστά!", "Γκούχου γκούχου", "Όχι", "Νιετ"],
		[true, false, false, false]
	),
	dialog.Question.new(
		"Τι πρέπει να γνωρίζει ο χρήστης όσον αφορά την ρύθμιση και τοποθέτηση της οθόνης;",
		["a) Η οθόνη πρέπει εύκολα να περιστρέφεται και να ρυθμίζεται η κλίση της", "b) Η εικόνα στην οθόνη να μετακινείται", "c) Η φωτεινότητα της οθόνης να ρυθμίζεται εύκολα", "d) Το κέντρο της οθόνης πρέπει να βρίσκεται σε ευθεία με το ύψος των ματιών του χρήστη"],
		["Γκούχου γκούχου", "Όχι", "Νιετ", "Σωστά!"],
		[false, false, false, true]
	),
	dialog.Question.new(
		"Τι δεν μπορεί να χαλάσει-καταστρέψει ο ιός (virus);",
		["a) Το υλικό", "b) Το λειτουργικό σύστημα", "c) Τα αρχεία που έχουμε δημιουργήσει", "d) Την ταχύτητα σύνδεσης στο διαδίκτυο"],
		["Σωστά!", "Γκούχου γκούχου", "Όχι", "Νιετ"],
		[true, false, false, false]
	),
	dialog.Question.new(
		"Ποια από τις ακόλουθες ορολογίες αντιστοιχεί στο Δοκιμαστικό Λογισμικό;",
		["a) Freeware", "b) Software", "c) Openware", "d) Shareware"],
		["Γκούχου γκούχου", "Όχι", "Νιετ", "Σωστά!"],
		[false, false, false, true]
	),
	dialog.Question.new(
		"Ποιο από τα πιο κάτω προγράμματα διατίθεται δωρεάν από τους δημιουργούς του;",
		["a) Shareware", "b) Software", "c) Openware", "d) Freeware"],
		["Γκούχου γκούχου", "Όχι", "Νιετ", "Σωστά!"],
		[false, false, false, true]
	),
	dialog.Question.new(
		"Τι προστατεύουν τα Πνευματικά δικαιώματα;",
		["a) Προστατεύουν τον καταναλωτή από πειρατικές εκδόσεις", "b) Προστατεύουν τον έμπορο από παράνομες ενέργειες", "c) Δημιουργούν δικλείδες ώστε να μην μπορεί να γίνει αντιγραφή", "d) Προστατεύουν από την παράνομη χρήση χωρίς την άδεια του δημιουργού"],
		["Γκούχου γκούχου", "Όχι", "Νιετ", "Σωστά!"],
		[false, false, false, true]
	),
	dialog.Question.new(
		"Τι συμβολίζουν τα αρχικά WAN;",
		["a) Wide Analog Network", "b) Wide Amazon Network", "c) Wide Application Network", "d) Wide Area Network"],
		["Γκούχου γκούχου", "Όχι", "Νιετ", "Σωστά!"],
		[false, false, false, true]
	),
	dialog.Question.new(
		"Τι συμβολίζουν τα αρχικά LAN;",
		["a) Local Area Netmap", "b) Local Area Network", "c) Local Area Newport", "d) Local Area Netlock"],
		["Γκούχου γκούχου", "Σωστά!", "Όχι", "Νιετ"],
		[false, true, false, false]
	)
]

func _answers_handler(answer_idx: int, answer: bool):
	print("answer_num is: " + str(answer_idx) + ", answer is: " + str(answer))
	
# Called when the node enters the scene tree for the first time.
func _ready():
	print("Starting the dialog")
	var ref = funcref(self, "_answers_handler")
	var timeline = dialog.new().create_timeline(questions, characters, ref)
	add_child(timeline)
	print("Dialog ended")
