extends Node

var dialog = load("res://Dialog.gd")

var characters = ["", "character-1684860727.json"]
var questions = [
	dialog.Question.new(
		"Σε έναν ανθρώπινο οργανισμό:",
		["α. όλα τα κύτταρα έχουν το ίδιο σχήμα και την ίδια λειτουργία.", "β. υπάρχουν κύτταρα με το ίδιο σχήμα και την ίδια λειτουργία.", "γ. κάθε όργανο αποτελείται από κύτταρα του ίδιου σχήματος.", "δ. όλα τα κύτταρα έχουν το ίδιο σχήμα και διαφορετική λειτουργία."],
		["Χμμ, δεν είμαι τόσο σίγουρος", "Μπαα", "Δυστυχώς όχι", "Σωστά!"],
		[false, false, false, true]
	),
	dialog.Question.new(
		"O φάρυγγας, o οισοφάγος, το στομάχι, το λεπτό και παχύ έντερο αποτελούν όλα μαζί:",
		["α. έναν ιστό.", "β. ένα όργανο.", "γ. έναν οργανισμό.", "δ. ένα σύστημα οργάνων."],
		["Όχι", "Γκούχου γκούχου", "Νιετ", "Σωστά!"],
		[false, false, false, true]
	),
	dialog.Question.new(
		"Κύτταρα όμοια μορφολογικά και λειτουργικά αποτελούν:",
		["α. ένα όργανο.", "β. έναν ιστό.", "γ. έναν οργανισμό.", "δ. ένα σύστημα οργάνων."],
		["Όχι", "Σωστά!", "Γκούχου γκούχου", "Νιετ"],
		[false, true, false, false]
	),
	dialog.Question.new(
		"Ο ρόλος του επιθηλιακού ιστού:",
		["α. είναι προστατευτικός.", "β. σχετίζεται με την απορρόφηση ουσιών.", "γ. σχετίζεται με την παραγωγή ουσιών.", "δ. εκφράζεται με τα α, β, γ."],
		["Όχι", "Γκούχου γκούχου", "Νιετ", "Σωστά!"],
		[false, false, false, true]
	),
	dialog.Question.new(
		"Το αίμα είναι:",
		["α. μυϊκός ιστός.", "β. συνδετικός ιστός.", "γ. επιθηλιακός ιστός.", "δ. νευρικός ιστός."],
		["Όχι", "Σωστά!", "Γκούχου γκούχου", "Νιετ"],
		[false, true, false, false]
	),
	dialog.Question.new(
		"Το σύστημα που συντονίζει όλες τις λειτουργίες του οργανισμού είναι:",
		["α. το νευρικό.", "β. το πεπτικό.", "γ. το αναπνευστικό.", "δ. το κυκλοφορικό."],
		["Σωστά!", "Γκούχου γκούχου", "Όχι", "Νιετ"],
		[true, false, false, false]
	),
	dialog.Question.new(
		"Οι αδένες:",
		["α. συμβάλλουν στην απορρόφηση ορισμένων ουσιών.", "β. προστατεύουν εξωτερικές επιφάνειες.", "γ. παράγουν και εκκρίνουν διάφορες ουσίες.", "δ. αποτελούνται μόνο από όμοια κύτταρα."],
		["Γκούχου γκούχου", "Όχι", "Σωστά!", "Νιετ"],
		[false, false, true, false]
	),
	dialog.Question.new(
		"Πέψη είναι:",
		["α. η είσοδος θρεπτικών ουσιών στον οργανισμό.", "β. η αποβολή των άχρηστων ουσιών.", "γ. η κατεργασία των τροφών για να απορροφηθούν οι θρεπτικές ουσίες.", "δ. η σύνθεση μεγαλομορίων από μικρότερα μόρια."],
		["Γκούχου γκούχου", "Όχι", "Σωστά!", "Νιετ"],
		[false, false, true, false]
	),
	dialog.Question.new(
		"Η βασική ουσία που περιέχει το σάλιο είναι:",
		["α. η πεψίνη.", "β. η αμυλάση.", "γ. η λεκιθίνη.", "δ. η βλέννα."],
		["Γκούχου γκούχου", "Σωστά!", "Όχι", "Νιετ"],
		[false,  true, false, false]
	),
	dialog.Question.new(
		"Το σάλιο που εκκρίνεται από τους σιελογόνους αδένες:",
		["α. διασπά το άμυλο σε απλούστερους υδατάνθρακες.", "β. περιέχει την ουσία αδαμαντίνη που κάνει τα δόντια σκληρά.", "γ. επηρεάζει την περισταλτική κίνηση του εντέρου.", "δ. περιέχει ορμόνη που βοηθάει την μετακίνηση της επιγλωττίδας."],
		["Σωστά!", "Γκούχου γκούχου", "Όχι", "Νιετ"],
		[true, false, false, false]
	),
	dialog.Question.new(
		"Στο παχύ έντερο γίνεται:",
		["α. προσωρινή αποθήκευση άπεπτων τροφών.", "β. παραγωγή ενζύμων από τους αδένες του.", "γ. απορρόφηση βιταμινών από τις λάχνες του.", "δ. διάσπαση πρωτεϊνών από την καρβοξυπεπτιδάση."],
		["Σωστά!", "Γκούχου γκούχου", "Όχι", "Νιετ"],
		[true, false, false, false]
	),
	dialog.Question.new(
		"Η χολή περιέχει 70:",
		["α. πρωτεΐνες.", "β. γλυκογόνο.", "γ. χρωστικές.", "δ. ένζυμα."],
		["Γκούχου γκούχου", "Όχι", "Σωστά!", "Νιετ"],
		[false, false, true, false]
	),
	dialog.Question.new(
		"Στο λεπτό έντερο:",
		["α. εκκρίνεται το υδροχλωρικό οξύ από το πάγκρεας.", "β. εξουδετερώνεται το υδροχλωρικό οξύ από το NaHCO3.", "γ. ενεργοποιείται το υδροχλωρικό οξύ από το πεψινογόνο.", "δ. το υδροχλωρικό οξύ απορροφάται μαζί με τη χολή από τις λάχνες."],
		["Γκούχου γκούχου", "Σωστά!", "Όχι", "Νιετ"],
		[false, true, false, false]
	),
	dialog.Question.new(
		"Στο ήπαρ γίνονται πολλές και σημαντικές λειτουργίες όπως:",
		["α. φιλτράρισμα του νερού από τις άχρηστες ουσίες.", "β. αποθήκευση γλυκόζης με την μορφή γλυκογόνου.", "γ. διάσπαση λιπών από τα χολικά άλατα.", "δ. παραγωγή βλέννας από τα ηπατικά κύτταρα."],
		["Γκούχου γκούχου", "Σωστά!", "Όχι", "Νιετ"],
		[false, true, false, false]
	),
	dialog.Question.new(
		"Το ένζυμο λυσοζύμη στο σάλιο:",
		["α. διασπά το άμυλο σε απλούστερους υδατάνθρακες.", "β. περιέχει την ουσία αδαμαντίνη που κάνει τα δόντια σκληρά.", "γ. επηρεάζει την περισταλτική κίνηση του εντέρου.", "δ. περιέχει ορμόνη που βοηθάει την μετακίνηση της επιγλωττίδας."],
		["Γκούχου γκούχου", "Όχι", "Σωστά!", "Νιετ"],
		[false, false, true, false]
	),
	dialog.Question.new(
		"Η ορμόνη ινσουλίνη που παράγεται στο πάγκρεας ρυθμίζει:",
		["α. την παραγωγή αμινοξέων.", "β. την διάσπαση των λιπών.", "γ. τον καταβολισμό των πρωτεϊνών.", "δ. την μετατροπή του γλυκογόνου σε γλυκόζη και αντίστροφα."],
		["Γκούχου γκούχου", "Όχι", "Νιετ", "Σωστά!"],
		[false, false, false, true]
	),
	dialog.Question.new(
		"Οι βιταμίνες είναι οργανικές ενώσεις που:",
		["α. παράγονται από ενδοκρινείς αδένες.", "β. τις προσλαμβάνουμε με τις τροφές.", "γ. παράγονται στο στομάχι.","δ. βρίσκονται μόνο στις ζωικές τροφές."],
		["Γκούχου γκούχου", "Σωστά!", "Όχι", "Νιετ"],
		[false, true, false, false]
	),
	dialog.Question.new(
		"Τα αγγεία του κυκλοφορικού συστήματος, κατά μήκος των οποίων διαχέονται τα διάφορα συστατικά στο μεσοκυττάριο χώρο είναι:",
		["α. τα τριχοειδή αγγεία.","β. οι φλέβες.", "γ. οι αρτηρίες.", "δ. τα λεμφικά αγγεία."],
		["Σωστά!", "Γκούχου γκούχου", "Όχι", "Νιετ"],
		[true, false, false, false]
	),
	dialog.Question.new(
		"Κατά τη μικρή κυκλοφορία το αίμα:",
		["α. διοχετεύεται στους ιστούς μεταφέροντας οξυγόνο.", "β. απορροφάει άχρηστες ουσίες για να τις αποβάλλει.", "γ. προσλαμβάνει από τους πνεύμονες οξυγόνο.", "δ. απορροφάει από το λεπτό έντερο θρεπτικές ουσίες."],
		["Γκούχου γκούχου", "Όχι", "Σωστά!", "Νιετ"],
		[false, false, true, false]
	),
	dialog.Question.new(
		"Το αίμα στους νεφρούς:",
		["α. αποβάλλει τοξικές ουσίες και περίσσεια νερού.", "β. διοχετεύεται με την ηπατική φλέβα.", "γ. απορροφάει θρεπτικές ουσίες.", "δ. εμπλουτίζεται με οξυγόνο."],
		["Σωστά!", "Γκούχου γκούχου", "Όχι", "Νιετ"],
		[true, false, false, false]
	),
	dialog.Question.new(
		"Κατά τη στεφανιαία κυκλοφορία:",
		["α. μεταφέρεται αίμα στην καρδιά δια μέσου της πυλαίας φλέβας.", "β. οι στεφανιαίες φλέβες τροφοδοτούν την καρδιά με θρεπτικές ουσίες.", "γ. αίμα πλούσιο σε οξυγόνο απομακρύνεται από τον καρδιακό ιστό.", "δ. τροφοδοτείται η καρδιά με χρήσιμες ουσίες και αποβάλλονται από αυτήν οι άχρηστες."],
		["Γκούχου γκούχου", "Όχι", "Νιετ", "Σωστά!"],
		[false, false, false, true]
	),
	dialog.Question.new(
		"Τα τριχοειδή αγγεία:",
		["α. αποτελούνται από πολλές στοιβάδες κυττάρων.", "β. περιέχουν μικρές βαλβίδες.", "γ. περιέχουν το 75% της ποσότητας του αίματος.", "δ. παρεμβάλλονται μεταξύ αρτηριών και φλεβών."],
		["Γκούχου γκούχου", "Όχι", "Νιετ", "Σωστά!"],
		[false, false, false, true]
	),
	dialog.Question.new(
		"Η μέγιστη αρτηριακή πίεση:",
		["α. παρατηρείται όταν η καρδιά χαλαρώνει.", "β. είναι υπεύθυνη για την ροή του αίματος στις αρτηρίες.", "γ. είναι υπεύθυνη για την κίνηση του αίματος στις φλέβες.", "δ. παρατηρείται στην πνευμονική αρτηρία."],
		["Γκούχου γκούχου", "Σωστά!", "Όχι", "Νιετ"],
		[false, true, false, false]
	),
	dialog.Question.new(
		"Ο ρόλος των βαλβίδων στις φλέβες είναι:",
		["α. να ελαττώνουν την πίεση του αίματος.", "β. να εμποδίζουν την αντίστροφη μετακίνηση του αίματος.", "γ. να σταθεροποιούν την ροή του αίματος.", "δ. να ελαττώνουν την ροή του αίματος."],
		["Γκούχου γκούχου", "Σωστά!", "Όχι", "Νιετ"],
		[false, true, false, false]
	)
]

func _answers_handler(answer_idx: int, answer: bool):
	print("answer_num is: " + str(answer_idx) + ", answer is: " + str(answer))

func _endline_handler():
	get_tree().change_scene("res://Scenes/Terrain2.tscn")

# Called when the node enters the scene tree for the first time.
func _ready():
	#Dialogic.change_timeline("timeline-1684860698.json")
	print("Starting the dialog")
	var ref = funcref(self, "_answers_handler")
	var endref = funcref(self, "_endline_handler")
	var timeline = dialog.new().create_timeline(questions, characters, ref, endref)
	add_child(timeline)
	print("Dialog ended")
