extends Node

var dialog = load("res://Dialog.gd")

var characters = ["character-1684872351.json", "character-1684872362.json"]
var questions = [
	dialog.Question.new(
		"Ποια από τα πιο κάτω δεν είναι λειτουργία της Κεντρικής Μονάδας Επεξεργασίας;",
		["a) Εκτελεί τις οδηγίες του προγράμματος", "b) Επιβεβαιώνει ότι οι οδηγίες του προγράμματος εκτελούνται με σωστή σειρά", "c) Αποστολή ηλεκτρονικού μηνύματος", "d) Διεξάγει υπολογισμούς"],
		["Χμμ, δεν είμαι τόσο σίγουρος", "Μπαα", "Σωστά!", "Δυστυχώς όχι"],
		[false, false, true, false]
	),
	dialog.Question.new(
		"Ποιο από τα πιο κάτω είναι ταυτόχρονα συσκευή εισόδου και εξόδου;",
		["a) Οθόνη αφής", "b) Πληκτρολόγιο ", "c) Εκτυπωτής", "d) Σαρωτής"],
		["Σωστά!", "Όχι", "Γκούχου γκούχου", "Νιετ"],
		[true, false, false, false]
	),
	dialog.Question.new(
		"Ποιο από τα ακόλουθα ισοδυναμεί με 13GB;",
		["a) 13000 bytes (περίπου)", "b) 13000 KB (περίπου)", "c) 13000 TB (περίπου)", "d) 13000 MB (περίπου)"],
		["Όχι", "Γκούχου γκούχου", "Νιετ", "Σωστά!"],
		[false, false, false, true]
	),
	dialog.Question.new(
		"Ποιο από τα πιο κάτω είναι λειτουργία της Κεντρικής Μονάδας Επεξεργασίας (KME);",
		["a) Εκτελεί όλες τις αριθμητικές και λογικές λειτουργίες στα δεδομένα", "b) Εκτελεί όλες τις γραφικές λειτουργίες στα δεδομένα", "c) Εκτελεί όλες τις κύριες λειτουργίες στα δεδομένα", "d) Εκτελεί όλες τις λειτουργίες συστήματος των δεδομένων"],
		["Σωστά!", "Όχι", "Γκούχου γκούχου",  "Νιετ"],
		[true, false, false, false]
	),
	dialog.Question.new(
		"Τί συμβολίζουν τα αρχικά RAM;",
		["a) Μνήμη Τυχαίας Επιτάχυνσης", "b) Μνήμη Τυχαίας Προσπέλασης", "c) Μνήμη Κανονικής Προσπέλασης", "d) Μνήμη Κανονικής Επιτάχυνσης"],
		["Όχι", "Σωστά!", "Γκούχου γκούχου", "Νιετ"],
		[false, true, false, false]
	),
	dialog.Question.new(
		"Ποια είναι η μικρότερη μονάδα μέτρησης του H/Y; ",
		["a) Megabyte", "b) Bit", "c) Kilobyte", "d) Byte"],
		["Γκούχου γκούχου", "Σωστά!", "Όχι", "Νιετ"],
		[false, true, false, false]
	),	
	dialog.Question.new(
		"Τί κάνει ένας διαμορφωτής/αποδιαμορφωτής (Modem);",
		["a) Προστατεύει ένα δίκτυο έναντι αυτών που σπάνε προγράμματα", "b) Συνδέει τον υπολογιστή σας με την τηλεφωνική γραμμή", "c) Αποκρύπτει τα δεδομένα του υπολογιστή", "d) Μετατρέπει ψηφιακά δεδομένα σε δεκαεξάδικο σύστημα"],
		["Γκούχου γκούχου", "Σωστά!", "Όχι", "Νιετ"],
		[false, true, false, false]
	),
	dialog.Question.new(
		"Όταν ανοίγει ο υπολογιστής και πριν φορτωθεί το λειτουργικό σύστημα, ποιος δίνει τις οδηγίες για την εκκίνηση και τον αρχικό έλεγχο του υπολογιστή;",
		["a) H μνήμη RAM", "b) O σκληρός δίσκος", "c) H μνήμη ROM", "d) O επεξεργαστής"],
		["Γκούχου γκούχου", "Όχι", "Σωστά!", "Νιετ"],
		[false, false, true, false]
	),
	dialog.Question.new(
		"Ποια από τις πιο κάτω εργασίες είναι λειτουργία του Λειτουργικού Συστήματος;",
		["a) Προσθήκη δεδομένων σε ένα υπολογιστικό φύλλο", "b) Εκπόνηση έκθεσης βάσης δεδομένων", "c) Διαχείριση αρχείων", "d) H παραγωγή μιας παρουσίασης"],
		["Γκούχου γκούχου", "Όχι", "Σωστά!", "Νιετ"],
		[false, false, true, false]
	),
	dialog.Question.new(
		"Ποια από τις πιο κάτω ενέργειες αποτελεί το τελευταίο μέρος της Επεξεργασίας Ανάπτυξης Συστημάτων;",
		["a) Έλεγχος", "b) Προγραμματισμός", "c) Σχεδιασμός", "d) Ανάλυση"],
		["Σωστά!", "Γκούχου γκούχου", "Όχι", "Νιετ"],
		[true, false, false, false]
	)
]

# Called when the node enters the scene tree for the first time.
func _ready():
	print("Starting the dialog")
	var timeline = dialog.new().create_timeline(questions, characters)
	add_child(timeline)
	print("Dialog ended")
