extends Node

var dialog = load("res://Dialog.gd")

var characters = ["character-1684872351.json", "character-1684872362.json"]
var questions = [
	dialog.Question.new(
		"Η επιτάχυνση ενός κινητού έχει πάντα κατεύθυνση:",
		["ίδια με αυτήν της ταχύτητάς του", "ίδια με αυτήν της κίνησής του", "ίδια με αυτήν της συνισταμένης των δυνάμεων που του ασκούνται", "κάθετη προς αυτήν της συνισταμένης των δυνάμεων που του ασκούνται"],
		["Χμμ, δεν είμαι τόσο σίγουρος", "Μπαα", "Σωστά!", "Δυστυχώς όχι"],
		[false, false, true, false]
	),
	dialog.Question.new(
		"Η επιτάχυνση ενός κινητού είναι σταθερή",
		["πάντα", "μόνο όταν η συνισταμένη των δυνάμεων που αυτό δέχεται είναι σταθερή", "ποτέ", "μόνο όταν το κινητό εκτελεί ευθύγραμμη ομαλά μεταβαλλόμενη κίνηση"],
		["Όχι", "Σωστά!", "Γκούχου γκούχου", "Νιετ"],
		[false, true, false, false]
	),
	dialog.Question.new(
		"Σύμφωνα με το Θεμελιώδη Νόμο της Μηχανικής, ένα σώμα που δέχεται μια μόνο σταθερή δύναμη κινείται σε κάθε περίπτωση",
		["προς την κατεύθυνση της δύναμης αυτής", "με σταθερή ταχύτητα", "με ταχύτητα της οποίας το μέτρο αυξάνεται με σταθερό ρυθμό", "με επιτάχυνση το διάνυσμα της οποίας παραμένει σταθερό"],
		["Όχι", "Γκούχου γκούχου", "Νιετ", "Σωστά!"],
		[false, false, false, true]
	),
	dialog.Question.new(
		"Η ελεύθερη πτώση ενός σώματος στη Γη",
		["είναι πάντα ευθύγραμμη κίνηση", "είναι κίνηση κατά την οποία η ταχύτητα του σώματος διατηρείται σταθερή", "είναι κίνηση με επιτάχυνση ίση με τη γήινη βαρυτική", "τίποτα από τα παραπάνω"],
		["Όχι", "Γκούχου γκούχου", "Σωστά!", "Νιετ"],
		[false, false, true, false]
	),
	dialog.Question.new(
		"Ένα σώμα ολισθαίνει ανεβαίνοντας σε κεκλιμένο δάπεδο με σταθερή ταχύτητα. Από αυτό συμπεραίνουμε ότι σε μια μετατόπιση του σώματος πάνω στο κεκλιμένο δάπεδο",
		["το έργο του βάρους του είναι μηδέν", "το έργο της συνισταμένης δύναμης πού δέχεται, είναι μηδέν", "η μεταβολή της δυναμικής ενέργειας του σώματος είναι μηδέν", "η μεταβολή της μηχανικής ενέργειας  του σώματος είναι μηδέν"],
		["Όχι", "Σωστά!", "Γκούχου γκούχου", "Νιετ"],
		[false, true, false, false]
	),
	dialog.Question.new(
		"Η τριβή είναι δύναμη που δημιουργείται στην επιφάνεια επαφής ενός σώματος με άλλο σώμα, όταν το ένα ολισθαίνει, ή τείνει να ολισθήσει πάνω στο άλλο. Η κατεύθυνση της τριβής που δέχεται το σώμα είναι τέτοια, ώστε πάντα",
		["να αντιτίθεται στην ολίσθηση του σώματος", "να αντιτίθεται στην κίνηση του σώματος", "να αντιτίθεται στην κίνηση και στην ολίσθηση του σώματος", "να βοηθά την κίνηση του σώματος"],
		["Σωστά!", "Γκούχου γκούχου", "Όχι", "Νιετ"],
		[true, false, false, false]
	),	
	dialog.Question.new(
		"Αν η συνισταμένη των δυνάμεων που ασκούνται σε ένα σώμα είναι μηδέν, τότε το σώμα",
		["παραμένει πάντα ακίνητο", "κινείται ευθύγραμμα και επιβραδύνεται μέχρι να ακινητοποι4ηθεί", "κινείται ευθύγραμμα και ομαλά ή ηρεμεί", "κινείται ευθύγραμμα ομαλά επιταχυνόμενα"],
		["Γκούχου γκούχου", "Όχι", "Σωστά!", "Νιετ"],
		[false, false, true, false]
	),
	dialog.Question.new(
		"Εξ ορισμού, η αδρανειακή μάζα ενός σώματος μπορεί να υπολογιστεί ως εξής",
		["τοποθετούμε το σώμα σε ένα ζυγό σύγκρισης και συγκρίνουμε τη μάζα του με γνωστές μάζες", "χρησιμοποιούμε δυναμόμετρο για να μετρήσουμε το βάρος του και στη συνέχεια την υπολογίζουμε", "ασκούμε δύναμη στο σώμα και μετράμε την επιτάχυνση που αποκτά", "μετράμε τον όγκο του σώματος και μέσω της πυκνότητας του βρίσκουμε τη μάζα"],
		["Γκούχου γκούχου", "Όχι", "Σωστά!", "Νιετ"],
		[false, false, true, false]
	)
]

# Called when the node enters the scene tree for the first time.
func _ready():
	print("Starting the dialog")
	var timeline = dialog.new().create_timeline(questions, characters)
	add_child(timeline)
	print("Dialog ended")
